//package com.example.demo;
//
//public interface MedicalEquipmentAPI {
//    // Метод отримання ідентифікатора обладнання
//    String getEquipmentId();
//
//    // Метод для отримання частоти серцевих скорочень з віртуального медичного обладнання
//    int getHeartRate();
//
//    // Метод отримання систолічного артеріального тиску з віртуального медичного обладнання
//    int getSystolicBloodPressure();
//
//    // Метод отримання діастолічного артеріального тиску з віртуального медичного обладнання
//    int getDiastolicBloodPressure();
//
//    // Метод отримання даних про насичення киснем з віртуального медичного обладнання
//    int getOxygenSaturation();
//
//    // Метод отримання температури з віртуального медичного обладнання
//    double getTemperature();
//}